chipKIT32/chipKIT-core/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MX210F016C__)
        #define _CPU_NAME_      "32MX210F016C"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  36
        #define __PIC32MX2XX__

    #elif defined(__32MX210F016D__)
        #define _CPU_NAME_      "32MX210F016D"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  44
        #define __PIC32MX2XX__

    #elif defined(__32MX220F032B__)
        #define _CPU_NAME_      "32MX220F032B"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  28
        #define __PIC32MX2XX__

    #elif defined(__32MX220F032C__)
        #define _CPU_NAME_      "32MX220F032C"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  36
        #define __PIC32MX2XX__

    #elif defined(__32MX220F032D__)
        #define _CPU_NAME_      "32MX220F032D"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  44
        #define __PIC32MX2XX__

    #elif defined(__32MX230F064B__)
        #define _CPU_NAME_      "32MX230F064B"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  28
        #define __PIC32MX2XX__

    #elif defined(__32MX230F064C__)
        #define _CPU_NAME_      "32MX230F064C"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  36
        #define __PIC32MX2XX__

    #elif defined(__32MX230F064D__)
        #define _CPU_NAME_      "32MX230F064D"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  44
        #define __PIC32MX2XX__

    #elif defined(__32MX250F128B__)
        #define _CPU_NAME_      "32MX250F128B"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  28
        #define __PIC32MX2XX__

    #elif defined(__32MX250F128C__)
        #define _CPU_NAME_      "32MX250F128C"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  36
        #define __PIC32MX2XX__

    #elif defined(__32MX250F128D__)
        #define _CPU_NAME_      "32MX250F128D"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  44
        #define __PIC32MX2XX__

    #elif defined(__32MX270F256B__)
        #define _CPU_NAME_      "32MX270F256B"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  28
        #define __PIC32MX2XX__

    #elif defined(__32MX270F256C__)
        #define _CPU_NAME_      "32MX270F256C"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  36
        #define __PIC32MX2XX__

    #elif defined(__32MX270F256D__)
        #define _CPU_NAME_      "32MX270F256D"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  44
        #define __PIC32MX2XX__

    //************************************************************************
    //*  MX  300 series

    #elif defined(__32MX320F032H__)
        #define _CPU_NAME_      "32MX320F032H"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX3XX__

    #elif defined(__32MX320F064H__)
        #define _CPU_NAME_      "32MX320F064H"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX3XX__

    #elif defined(__32MX320F128H__)
        #define _CPU_NAME_      "32MX320F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX3XX__

    #elif defined(__32MX340F128H__)
        #define _CPU_NAME_      "32MX340F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX3XX__

    #elif defined(__32MX340F256H__)
        #define _CPU_NAME_      "32MX340F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX3XX__

    #elif defined(__32MX340F512H__)
        #define _CPU_NAME_      "32MX340F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX3XX__

    #elif defined(__32MX320F128L__)
        #define _CPU_NAME_      "32MX320F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX3XX__

    #elif defined(__32MX340F128L__)
        #define _CPU_NAME_      "32MX340F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX3XX__

