chipKIT32/chipKIT-core/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MX675F256H__)
        #define _CPU_NAME_      "32MX675F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX675F512H__)
        #define _CPU_NAME_      "32MX675F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX695F512H__)
        #define _CPU_NAME_      "32MX695F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__ 64
        #define __PIC32MX6XX__

    #elif defined(__32MX664F064L__)
        #define _CPU_NAME_      "32MX664F064L"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX664F128L__)
        #define _CPU_NAME_      "32MX664F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX675F256L__)
        #define _CPU_NAME_      "32MX675F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX675F512L__)
        #define _CPU_NAME_      "32MX675F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX695F512L__)
        #define _CPU_NAME_      "32MX695F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    //************************************************************************
    //*  MX  700 series

    #elif defined(__32MX764F128H__)
        #define _CPU_NAME_      "32MX764F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX775F256H__)
        #define _CPU_NAME_      "32MX775F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX775F512H__)
        #define _CPU_NAME_      "32MX775F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX795F512H__)
        #define _CPU_NAME_      "32MX795F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX764F128L__)
        #define _CPU_NAME_      "32MX764F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

    #elif defined(__32MX775F256L__)
        #define _CPU_NAME_      "32MX775F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

    #elif defined(__32MX775F512L__)
        #define _CPU_NAME_      "32MX775F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

    #elif defined(__32MX795F512L__)
        #define _CPU_NAME_      "32MX795F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

    //************************************************************************
    //*  MZ  EC series
        
    #elif defined(__32MZ1024ECG064__)
        #define _CPU_NAME_      "32MZ1024ECG064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECH064__)
        #define _CPU_NAME_      "32MZ1024ECH064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECM064__)
        #define _CPU_NAME_      "32MZ1024ECM064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECG064__)
        #define _CPU_NAME_      "32MZ2048ECG064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECH064__)
        #define _CPU_NAME_      "32MZ2048ECH064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECM064__)
        #define _CPU_NAME_      "32MZ2048ECM064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECG100__)
        #define _CPU_NAME_      "32MZ1024ECG100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
 
    #elif defined(__32MZ1024ECH100__)
        #define _CPU_NAME_      "32MZ1024ECH100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECM100__)
        #define _CPU_NAME_      "32MZ1024ECM100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
 
